In [1]:
# In this lecture, we are going to perform multiple operations on Pandas DataFrame

In [2]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyx']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyx

In [6]:
df['col2'].unique()        # This fun is finding unique values in col2 using unique()

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique())    # This is going to check the length of col2 and making it unique

3

In [8]:
df['col2'].nunique()        # nunique() is the built-in pandas function to check the length.

3

In [9]:
df['col2'].value_counts()      # This checks the values in a particular column that how many time each value occured in that column

444    2
555    1
666    1
Name: col2, dtype: int64

In [10]:
# selecting the data

In [11]:
df[df['col1']>2]           # this returns dataframe where col1 is greater than 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyx

In [12]:
df['col1']>2     # This simpler command is boolian, if we get it in df[] then it will return dataframe otherwise it is only a boolian value

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
df[(df['col1']>2) & (df['col2']==444)]     # returns only dataframe where col2 is equals to 444

   col1  col2 col3
3     4   444  xyx

In [ ]:
# Apply function()

In [14]:
def times2(x):
    return x*2

In [15]:
df['col1'].sum()

10

In [16]:
df['col1'].apply(times2)          # this will doubled the each value of col1 by multiplying each value with 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col3'].apply(len)       # returns the lenght of each value in col3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
df['col2'].apply(lambda X: X*2)        # multiply col2 values using lambda function

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [19]:
df.columns     # returns the columns of dataframe

Index(['col1', 'col2', 'col3'], dtype='object')

In [20]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyx

In [23]:
df.sort_values(by='col2')     # sorts the dataframe by col2

   col1  col2 col3
0     1   444  abc
3     4   444  xyx
1     2   555  def
2     3   666  ghi

In [24]:
# Pivot_Table

In [28]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
        'C':['X','Y','X','Y','X','Y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [29]:
df

     A    B  C  D
0  foo  one  X  1
1  foo  one  Y  3
2  foo  two  X  2
3  bar  two  Y  5
4  bar  one  X  4
5  bar  one  Y  1